<?php

//------------------------------------------------------------------------------
// Главная страница
//------------------------------------------------------------------------------
Route::get('/', function(){
	$view = View::make('home')->with('navActive', '');

	// для авторизации через социальные сети, пока непонятно как работает
	if(Input::has('token')) {
		$s = file_get_contents('http://ulogin.ru/token.php?token=' . Input::get('token') . '&host=' . $_SERVER['HTTP_HOST']);
		$user = json_decode($s, true);
	}

	return $view;
});

//------------------------------------------------------------------------------
// Регистрация новых пользователей(вся авторизация через модуль auth)
//------------------------------------------------------------------------------
Route::controller('registration', 'RegistrationController');


//------------------------------------------------------------------------------
// Авторизация пользователя посредством ajax
//------------------------------------------------------------------------------
Route::post('/signin', function () {
	if (Auth::attempt(array('email' => Input::get('email'), 'password' => Input::get('password')), true)) {
		return 'correct';
	} else {
		return 'error';
	}
});

//------------------------------------------------------------------------------
// Форма входа
//------------------------------------------------------------------------------
Route::get('/login', function() {
	return View::make('login')->with('navActive', 'login');
});

//------------------------------------------------------------------------------
// Выход пользователя из системы
//------------------------------------------------------------------------------
Route::get('/logout', function () {
	Auth::logout();
	return Redirect::to('/');
});

//------------------------------------------------------------------------------
// Закрываем эти разделы авторизацией
//------------------------------------------------------------------------------
Route::group(array('before' => 'auth'), function () {

	//------------------------------------------------------------------------------
	// Профайлы общий роутинг
	//------------------------------------------------------------------------------
	Route::controller('profiles', 'ProfilesController');

	//------------------------------------------------------------------------------
	// Проекты общий роутинг
	//------------------------------------------------------------------------------
	Route::controller('projects', 'ProjectsController');

	//------------------------------------------------------------------------------
	// События общий роутинг	
	//------------------------------------------------------------------------------
	Route::controller('events', 'EventsController');

	//------------------------------------------------------------------------------
	// Объявления общий роутинг
	//------------------------------------------------------------------------------
	Route::controller('adverts', 'AdvertsController');

	//------------------------------------------------------------------------------
	// Сообщения общий роутинг
	//------------------------------------------------------------------------------
	Route::controller('messages', 'MessagesController');

});



