<?php

Class Messages extends Eloquent {

	protected $table = 'messages';

	//------------------------------------------------------------------------------
	// Отправитель
	//------------------------------------------------------------------------------
	function sender() {
		return $this->belongsTo('User', 'sender_id');
	}

	//------------------------------------------------------------------------------
	// Получатель
	//------------------------------------------------------------------------------
	function recipient() {
		return $this->belongsTo('User', 'recipient_id');
	}



}